fio-test/results/crazns_seq_write/4096k-psync-1.out
job1: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=899934: Sun Sep 15 19:02:26 2024
  write: IOPS=1146, BW=4588MiB/s (4810MB/s)(673GiB/150251msec); 0 zone resets
    clat (usec): min=2034, max=18116, avg=6660.55, stdev=1771.49
     lat (usec): min=2364, max=18531, avg=6969.05, stdev=1810.31
    clat percentiles (usec):
     |  1.00th=[ 5014],  5.00th=[ 5211], 10.00th=[ 5342], 20.00th=[ 5473],
     | 30.00th=[ 5604], 40.00th=[ 5735], 50.00th=[ 5932], 60.00th=[ 6128],
     | 70.00th=[ 6587], 80.00th=[ 8029], 90.00th=[ 8979], 95.00th=[ 9765],
     | 99.00th=[14222], 99.50th=[15139], 99.90th=[16319], 99.95th=[16712],
     | 99.99th=[17433]
   bw (  MiB/s): min= 2880, max= 5811, per=100.00%, avg=4595.69, stdev=97.81, samples=2400
   iops        : min=  720, max= 1450, avg=1147.80, stdev=24.44, samples=2400
  lat (msec)   : 4=0.05%, 10=96.41%, 20=3.55%
  cpu          : usr=4.60%, sys=1.94%, ctx=172416, majf=0, minf=1165
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,172320,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4588MiB/s (4810MB/s), 4588MiB/s-4588MiB/s (4810MB/s-4810MB/s), io=673GiB (723GB), run=150251-150251msec

Disk stats (read/write):
    dm-0: ios=0/622530, merge=0/0, ticks=0/3853396, in_queue=3853396, util=100.00%, aggrios=11/330981, aggrmerge=0/166, aggrticks=1/37821, aggrin_queue=37823, aggrutil=100.00%
  nvme0n1: ios=0/52455, merge=0/0, ticks=0/1686, in_queue=1686, util=67.77%
  nvme3n1: ios=0/52453, merge=0/0, ticks=0/1734, in_queue=1734, util=67.84%
  nvme1n2: ios=26/605178, merge=0/356, ticks=2/72652, in_queue=72655, util=100.00%
  nvme4n2: ios=12/622337, merge=0/429, ticks=2/76865, in_queue=76866, util=100.00%
  nvme2n1: ios=0/52452, merge=0/0, ticks=0/1728, in_queue=1728, util=67.85%
  nvme0n2: ios=36/605283, merge=0/251, ticks=2/73188, in_queue=73191, util=100.00%
  nvme3n2: ios=18/609517, merge=0/325, ticks=2/73900, in_queue=73902, util=100.00%
  nvme1n1: ios=0/52453, merge=0/0, ticks=0/1702, in_queue=1703, util=67.86%
  nvme4n1: ios=0/52455, merge=0/0, ticks=0/1779, in_queue=1779, util=67.87%
  nvme2n2: ios=20/605235, merge=0/299, ticks=2/72985, in_queue=72986, util=100.00%