fio-test/results/crazns_seq_write/64k-psync-5.out
job1: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=44961: Sun Sep  8 05:42:54 2024
  write: IOPS=29.0k, BW=1811MiB/s (1899MB/s)(673GiB/380550msec); 0 zone resets
    clat (usec): min=68, max=3108, avg=271.06, stdev=72.69
     lat (usec): min=69, max=3111, avg=273.93, stdev=73.04
    clat percentiles (usec):
     |  1.00th=[  182],  5.00th=[  192], 10.00th=[  198], 20.00th=[  208],
     | 30.00th=[  217], 40.00th=[  241], 50.00th=[  285], 60.00th=[  293],
     | 70.00th=[  297], 80.00th=[  306], 90.00th=[  330], 95.00th=[  371],
     | 99.00th=[  619], 99.50th=[  660], 99.90th=[  709], 99.95th=[  758],
     | 99.99th=[ 1221]
   bw (  MiB/s): min= 1358, max= 3011, per=100.00%, avg=1814.92, stdev=33.25, samples=6073
   iops        : min=21729, max=48184, avg=29038.03, stdev=532.02, samples=6073
  lat (usec)   : 100=0.02%, 250=41.92%, 500=56.69%, 750=1.32%, 1000=0.04%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=2.35%, sys=4.73%, ctx=11028561, majf=0, minf=137
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,11028480,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1811MiB/s (1899MB/s), 1811MiB/s-1811MiB/s (1899MB/s-1899MB/s), io=673GiB (723GB), run=380550-380550msec

Disk stats (read/write):
    dm-0: ios=48/11026490, merge=0/0, ticks=0/2818292, in_queue=2818292, util=100.00%, aggrios=11/2205696, aggrmerge=0/0, aggrticks=0/95345, aggrin_queue=95346, aggrutil=100.00%
  nvme0n1: ios=0/1654272, merge=0/0, ticks=0/74838, in_queue=74837, util=100.00%
  nvme3n1: ios=0/1654272, merge=0/0, ticks=0/75825, in_queue=75825, util=100.00%
  nvme1n2: ios=26/2757120, merge=0/0, ticks=2/115337, in_queue=115338, util=100.00%
  nvme4n2: ios=12/2757120, merge=0/0, ticks=1/112427, in_queue=112429, util=100.00%
  nvme2n1: ios=0/1654272, merge=0/0, ticks=0/76286, in_queue=76286, util=100.00%
  nvme0n2: ios=36/2757120, merge=0/0, ticks=2/115253, in_queue=115255, util=100.00%
  nvme3n2: ios=18/2757120, merge=0/0, ticks=2/116074, in_queue=116075, util=100.00%
  nvme1n1: ios=0/1654272, merge=0/0, ticks=0/74799, in_queue=74800, util=100.00%
  nvme4n1: ios=0/1654272, merge=0/0, ticks=0/75272, in_queue=75271, util=100.00%
  nvme2n2: ios=20/2757120, merge=0/0, ticks=2/117343, in_queue=117345, util=100.00%